Repository: NateWr/good-reviews-wp
Catalog: languages/good-review-wp-*.po
Languages: he_il

source: Help
he_il: עזרה

source: Enter reviewer here
he_il: הזן כאן את הסוקר

source: Read More
he_il: קרא עוד

source: Show excerpt only
he_il: הצג מובאה בלבד

source: Show all reviews
he_il: הצג את כל הסקירות

source: Title
he_il: כותרת

source: Category:
he_il: קטגוריה:

source: Display one or all of your reviews.
he_il: הצג את כל הסקירות שלך או אחת מהן.

source: Review Categories
he_il: קטגוריות סקירה

source: To show all reviews in a list, use the snippet below.
he_il: כדי להציג את כל הסקירות ברשימה, השתמש בקטע שלהלן.

source: Copy and paste the snippet below into any post, page or text widget in order to display this review.
he_il: העתק והדבק את הקטע שלהלן אל כל פוסט, עמוד או וידג'ט טקסט כדי להציג את הסקירה הזו.

source: Once this review is published, look here to find the shortcode you will use to display this review in any post, page or text widget.
he_il: עם פרסום הסקירה, ניתן למצוא כאן את קיצור הקוד שישמש להצגת הסקירה הזו בכל פוסט, עמוד או וידג'ט טקסט.

source: Show rating as stars
he_il: הצג דירוג כוכבים

source: Show rating as numbers (9/10)
he_il: הצג דירוג כמספרים (9/10)

source: Don't show the rating
he_il: אל תציג דירוג

source: Maximum rating possible
he_il: דירוג מירבי אפשרי

source: out of
he_il: מתוך

source: Review Date
he_il: תאריך הסקירה

source: Organization Website
he_il: אתר ארגון

source: Reviewer Organization
he_il: ארגון הסוקר

source: Review Shortcode
he_il: קיצור קוד הסקירה

source: Rating
he_il: דירוג

source: Reviewer Details
he_il: פרטי הסוקר

source: Review Link
he_il: קישור הסקירה

source: All Reviews
he_il: כל הסקירות

source: No reviews found in trash
he_il: לא נמצאו סקירות באשפה

source: No reviews found
he_il: לא נמצאו סקירות

source: Search Reviews
he_il: חיפוש סקירות

source: View Review
he_il: הצג סקירה

source: New Review
he_il: סקירה חדשה

source: Edit Review
he_il: עריכת סקירה

source: Add New Review
he_il: הוספת סקירה חדשה

source: Add New
he_il: הוספה

source: Review
he_il: סקירה

source: Reviews
he_il: סקירות

source: reviews
he_il: סקירות

source: Add New Review Category
he_il: הוספת קטגוריה חדשה לסקירה

source: Update Review Category
he_il: עדכון קטגוריית סקירה

source: Edit Review Category
he_il: עריכת קטגוריית סקירה

source: Review Category:
he_il: קטגוריית סקירה:

source: Review Category
he_il: קטגוריית סקירה

source: All Review Categories
he_il: כל קטגוריות הסקירה

source: Search Review Categories
he_il: חיפוש בקטגוריות הסקירה
